---
kind: type
id: T:Autodesk.Revit.DB.Architecture.HandRailType
source: html/8db101a3-6229-8b94-4687-9cbaec787ef2.htm
---
# Autodesk.Revit.DB.Architecture.HandRailType

A rail type object that is used in the generation of hand rail.

## Syntax (C#)
```csharp
public class HandRailType : ContinuousRailType
```